export/issues/2.tex
% Created 2024-07-06 Sat 17:24
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=1in]{geometry}
\author{Gleefre}
\date{\today}
\title{PLN CDR draft: Issue 2}
\hypersetup{
 pdfauthor={Gleefre},
 pdftitle={PLN CDR draft: Issue 2},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2 (Org mode 9.5.5)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section{Issue 2 (PRINT-READ consistency)}
\label{sec:org564adcb}
\subsection{Description}
\label{sec:org4b0dbbe}
The Lisp reader uses \texttt{find-package} when reading a symbol, which is affected by the
\emph{local nicknames} of the \emph{current package}. That means that to maintain \textbf{print-read}
consistency when printing a symbol, a good \emph{package prefix} must be used - such that
calling \texttt{find-package} on it in the \emph{current package} returns the \emph{home package} of
the symbol.

There are several situations to consider:
\begin{enumerate}
\item The symbol is \emph{apparently uninterned}.

\emph{In this case it is printed without the package prefix, using the uninterned
symbol syntax \texttt{\#:}.}

\item The symbol is accessible in the \emph{current package}.

\emph{In this case it is printed without any package prefix.}

\item The \emph{name} or one of the \emph{global nicknames} of the \emph{home package} of the symbol
is not shadowed by any \emph{local nickname} defined in the \emph{current package}.

\emph{In this case that name or global nickname might be used as the package prefix.}

\item There exists a \emph{local nickname} defined in the \emph{current package} for the \emph{home
package} of the symbol.

\emph{In this case that local nickname might be used as the package prefix.}

\item Both the \emph{name} and all \emph{global nicknames} of the \emph{home package} of the symbol
are shadowed by \emph{local nicknames} of the \emph{current package}, and there is no
\emph{local nickname} defined in the \emph{current package} for the \emph{home package}.

\emph{It is not clear how the symbol is printed, see PROPOSALS.}
\end{enumerate}
\subsection{Examples}
\label{sec:org7176e4f}
\begin{verbatim}
(defpackage #:foo
  (:use)
  (:export #:+))

(defpackage #:bar
  (:use #:cl)
  (:local-nicknames (#:foo #:cl)))

(let ((*package* (find-package '#:bar)))
  (print 'foo:+))
; >> FOO:+  (sbcl, ccl, ecl, acl, abcl, clasp, lispworks)

;; In the package #:BAR symbol FOO:+ refers to CL:+
\end{verbatim}

\begin{verbatim}
(defpackage #:foo-a (:use) (:export #:quux))
(defpackage #:foo-b (:use) (:export #:quux))

(defpackage #:bar
  (:use)
  (:local-nicknames (#:foo-a #:foo-b)
                    (#:foo-b #:foo-a)))

(let ((*package* (find-package '#:bar)))
  (print 'foo-a:quux))
; >> FOO-B:QUUX  (sbcl, ccl, abcl, lispworks)
; >> FOO-A:QUUX  (ecl, acl, clasp)

;; In the package #:BAR symbol FOO-A:QUUX refers to FOO-B:QUUX
\end{verbatim}
\subsection{Current behavior}
\label{sec:org02fef91}
sbcl, ccl, abcl, lispworks:
  When possible, a \emph{local nickname} is used as a package prefix.

ecl, acl, clasp:
  \emph{Local nicknames} are never used as a package prefix.
\subsection{Proposal SHARPSIGN-DOT}
\label{sec:orga0327df}
In the 5th case the symbol is printed using the \texttt{\#.} syntax:

\begin{verbatim}
#.(cl:let ((cl:*package* (cl:find-package "KEYWORD")))
    (cl:find-symbol "BAR" "FOO"))
;; or
#.(cl:let ((cl:*package* (cl:find-package "KEYWORD")))
    (cl:intern "BAR" "FOO"))
\end{verbatim}

If \texttt{*read-eval*} is \emph{false} and \texttt{*print-readably*} is \emph{true}, an error of type
\texttt{print-not-readable} is signaled.
\subsubsection{Note}
\label{sec:org6da97ab}
Since \texttt{\#:KEYWORD} cannot be used as a \emph{local nickname}, and no \emph{local nicknames}
can be defined in the \texttt{\#:KEYWORD} package, this expression is guaranteed to
evaluate to the symbol in the correct package.
\subsection{Proposal SHARPSIGN-COLON}
\label{sec:org2955dbc}
In the 5th case the symbol is printed using the \emph{extended \texttt{\#:} syntax}:
\begin{verbatim}
#:(package name)
#::(package name)
\end{verbatim}

\emph{Shinmera's idea}.
\subsection{Proposal SHARPSIGN-BACKQUOTE}
\label{sec:orgdbf8b68}
In the 5th case the symbol is printed using the new \texttt{\#`} syntax for reading an
expression ignoring \emph{local nicknames} in the \emph{current package}:
\begin{verbatim}
#`foo:bar
#`foo::bar
\end{verbatim}

It can be implemented roughly as follows:
\begin{verbatim}
(defun |#`-reader| (stream subchar arg)
  (declare (ignore subchar arg))
  (let* ((current-package *package*)
         (local-nicknames (package-local-nicknames current-package)))
    (loop for (nick . package) in local-nicknames
          do (remove-package-local-nickname nick current-package))
    (unwind-protect
      (read stream t nil t)
      (loop for (nick . package) in local-nicknames
            do (add-package-local-nickname nick package current-package)))))

(set-dispatch-macro-character #\# #\` #'|#`-reader|)
\end{verbatim}
It is \emph{implementation-dependent} whether \emph{local nicknames} are actually removed from
the \emph{current package} or not.
\subsection{Proposal PRINT-UNREADABLY}
\label{sec:org067a74e}
In the 5th case the symbol is printed unreadably using the \texttt{\#<} syntax:
\begin{verbatim}
#<SYMBOL IN THE SHADOWED PACKAGE FOO:BAR>
#<SYMBOL IN THE SHADOWED PACKAGE FOO::BAR>
\end{verbatim}

(Specifics are \emph{implementation-dependent}.)

If \texttt{*print-readably*} is \emph{true}, an error of type \texttt{print-not-readable} is signaled.
\subsection{Proposal THREE-FOUR-PACKAGE-MARKERS}
\label{sec:org236f87a}
In the 5th case the symbol is printed using the extended symbol token syntax:
\begin{verbatim}
foo:::bar   ; same as (cl:find-symbol "BAR" "FOO") in the #:KEYWORD package
foo::::bar  ; same as (cl:intern "BAR" "FOO") in #:KEYWORD package
\end{verbatim}
\subsection{Links}
\label{sec:orgd745b41}
See \href{https://www.lispworks.com/documentation/HyperSpec/Body/22\_acca.htm}{CLHS 22.1.3.3.1 Package Prefixes for Symbols}.
\end{document}